     D myArr           s             10a   dim(5) ctdata
     D i               s              2s 0

       for i = 1 to 5;
        dsply myArr(i);
       endfor;

       *inlr = *on;
**CTDATA MYARR
Hello
My
Name
Is
Patricio
