     A                                      UNIQUE
     A          R TWPOSTR
     A            POUSID    R               REFFLD(USID TWUSER)
     A            POID           6S 0
     A            POCONT       255A
     A*
     A            POCRTS          Z
     A*
     A          K POUSID
     A          K POID
