     A                                      UNIQUE
     A          R MDMOCAR
     A            MCID           4S 0
     A            MCACID         4S 0
     A            MCMOID         4S 0
     A            MCROLE        10A
     A
     A          K MCID
