     A                                      UNIQUE
     A          R MDMOVIR
     A            MOID           4S 0
     A            MOTITL        52A
     A            MOPRDT          L
     A            MOLANG         5A
     A            MOCTRY         2A
     A
     A          K MOID
