     A                                      UNIQUE
     A          R MDMODIR
     A            MDID           4S 0
     A            MDDRID         4S 0
     A            MDMOID         4S 0
     A
     A          K MDID
