     A                                      UNIQUE
     A          R MDPEOPR
     A            PEID           4S 0
     A            PEFNAM        52A
     A            PELNAM        52A
     A            PEBDAT          L
     A
     A          K PEID
