     C*
     C                     CALL 'DTINCR'
     C                     PARM 20211027  PIDATE  80
     C                     PARM 0         PODATE  80
     C*
     C           PIDATE    DSPLY
     C           PODATE    DSPLY
     C*
     C                     SETON                         LR
